{
  "req": {
    "body": {
      "data": {
        "first_name": "Emmanuel",
        "middle_name": "Lumba",
        "last_name": "Mingala",
        "birthday": "2025-01-01",
        "age": null,
        "sex": ["Female"],
        "home_address": "dadf",
        "contact_number": "09776764748",
        "office_address": "sdfasf",
        "contact_number_2": "09776764748",
        "occupation": "Student",
        "child_name": "Sylvie",
        "child_birthday": "2025-01-01",
        "child_age": null,
        "child_gender": ["Female"],
        "birth_weight": null,
        "aog": null,
        "donor_type": ["Community"],
        "Why do you want to donate milk? (Bakit mo gusto magbigay ng iyong gatas / breastmilk?)": "sdfsda",
        "How did you learn about Taguig City Human Milk Bank? (Paano mo nalaman ang tungkol sa Taguig City Human Milk Bank?)": "dsfsadf",
        "Are you willing to donate breast milk on a regular basis for a minimum period of 6 months? (Gusto mo bang magbigay ng gatas nang regular sa loob ng 6 na buwan?)": [
          "Yes"
        ],
        "Will you be allowed by your husband to donate your breast milk to the Taguig City Human Milk Bank? (Papayagan ka ba ng iyong asawa na magbigay ng iyong gatas sa Taguig City Human Milk Bank?)": [
          "Yes"
        ],
        "Have you donated breast milk before? (Nakapagbigay ka na ba ng iyong gatas dati?)": [
          "No"
        ],
        "Have you for any reason been deferred as a milk donor? (Ikaw ba ay natangihan na magbigay ng iyong gata / breastmilk?)": [
          "No"
        ],
        "If yes, for what reason? (Kung oo, sa anong kadahilanan?)": null,
        "Did you have a normal pregnancy and delivery for your most recent pregnancy? (Normal ba ang panganganak mo sa huli mong anak?)": [
          "No"
        ],
        "Do you have any acute or chronic infection, systemic disorders, tuberculosis or history of hepatitis? (Mayroon ka bang kahit anong impeksyon o sakit? Nagkaroon ng sakit sa atay dati?)": [
          "No"
        ],
        "Have you received any blood transfusion or other blood products within the last 12 months? (Ikaw ba ay nasalinan ng dugo o kahit anong produkto mula sa dugo nitong nakaraang 12 buwan?)": [
          "No"
        ],
        "Have you received any organ or tissue transplant within the last 12 months? (Ikaw ba ay nakatanggap ng parte ng katawan mula sa ibang tao nitong nakaraang 12 buwan?)": [
          "No"
        ],
        "Within the last 24 hours, have you had intake of any hard liquor or alcohol? (Nakainom ka ba ng alak nitong nakaraang 24 oras?)": [
          "No"
        ],
        "If yes, how much? (Kung oo, gaano kadami?)": null,
        "Do you regularly use over-the-counter medications or systemic preparations such as replacement hormones and some birth control hormones? (Regular ka bang gumagamit ng mga gamot gaya ng mga hormones o pills?)": [
          "No"
        ],
        "Do you use megadose vitamins or pharmacologically active herbal preparations? (Gumagamit ka ba ng mga 'megadose vitamins' o mga 'herbal drugs'?)": [
          "No"
        ],
        "Are you a total vegetarian/vegan? (Ikaw ba ay hindi kumakain ng karne o isang vegetarian?)": [
          "No"
        ],
        "If yes, do you supplement your diet with vitamins? (Kung oo, umiinom ka ba ng multivitamins?)": [
          "No"
        ],
        "Do you use illicit drugs? (Gumagamit ka ba ng ipinagbabawal na gamot?)": [
          "No"
        ],
        "Do you smoke? (Ikaw ba ay naninigarilyo?)": ["No"],
        "If yes, how many sticks per day? (Kung oo, ilang stick o pack sa isang araw?)": null,
        "Have you had syphilis, HIV, herpes, or any sexually-transmitted disease? (Nagkakaroon ka ba ng sakit na nakukuha sa pakikipagtalik /sex?)": [
          "No"
        ],
        "Do you have multiple sex partners? (Nagkaroon ka ba ng karanasang makipagtalik sa hindi lang iisang lalaki?)": [
          "No"
        ],
        "Have you had a sexual partner from any of the following? (Nagkaroon ka ba ng partner mula sa mga sumusunod?)": [
          "None of the above"
        ],
        "Have you had a sexual partner from any of the following? (Nagkaroon ka ba ng partner mula sa mga sumusunod?) (Bisexual? (Nakipagtalik sa kapwa niya kauri?))": false,
        "Have you had a sexual partner from any of the following? (Nagkaroon ka ba ng partner mula sa mga sumusunod?) (Promiscuous? (Nakipagtalik sa higit isang tao?))": false,
        "Have you had a sexual partner from any of the following? (Nagkaroon ka ba ng partner mula sa mga sumusunod?) (Had an STD, AIDS/HIV? (Nagkaroon ng sakit na nakukuha sa pagtatalik gaya ng STD, AIDS/HIV?))": false,
        "Have you had a sexual partner from any of the following? (Nagkaroon ka ba ng partner mula sa mga sumusunod?) (Received blood for a long period of time for a bleeding problem? (Naulit-ulit nasalinan ng dugo?))": false,
        "Have you had a sexual partner from any of the following? (Nagkaroon ka ba ng partner mula sa mga sumusunod?) (Intravenous drug user? (Gumagamit ng gamot ng walang pahintulot ng doktor?))": false,
        "Have you had a sexual partner from any of the following? (Nagkaroon ka ba ng partner mula sa mga sumusunod?) (None of the above)": true,
        "Have you had a tattoo applied or have had accidental needlestick or contact with someone else's blood? (Nagpalagay ka na ba ng tattoo, naturukan ng karayom nang hindi sinasadya o nadikit sa dugo ng ibang tao?)": [
          "No"
        ],
        "Is your child healthy? (Malusog ba ang iyong anak?)": ["No"],
        "Was your child delivered full term? (Ipinanganak ba ang anak mo na husto sa buwan?)": [
          "No"
        ],
        "Are you exclusively breastfeeding your child? (Purong gatas mo ba ang binibigay mo sa anak mo at walang halong ibang formula / gatas?)": [
          "No"
        ],
        "Is/Was your youngest child jaundiced? (Madilaw/nanilaw ba ang bunso mong anak?)": [
          "No"
        ],
        "If yes, at what age and for how long? (Kung oo, anong edad at gaano katagal?)": null,
        "Has your child ever received milk from another mother? (Nakatanggap na ba ang iyong anak ng gatas/ breast milk mula sa ibang ina?)": [
          "No"
        ],
        "If yes, where? (Kung oo, saan?)": null,
        "DONOR'S SIGNATURE": [
          {
            "id": "xaorJJ",
            "name": "73259d8b-dde9-4907-9a6a-2a5b90e877b3.png",
            "url": "https://storage.tally.so/private/73259d8b-dde9-4907-9a6a-2a5b90e877b3.png?id=xaorJJ&accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6Inhhb3JKSiIsImZvcm1JZCI6IjNOTThYUSIsImlhdCI6MTczNjg3NjQ3OH0.hZskHehn5twPYexm28uzncZfKukjU1NbvEzLJivJNY4&signature=0e2fd45b283e8c1fff277aa46b2ca84400b5b4f8258c3181579ca25df25d64f8",
            "mimeType": "image/png",
            "size": 4614
          }
        ]
      }
    }
  }
}
